In [1]:
import pandas as pd
import numpy as np

## Задача 1

Создайте датафрейм из текущих списков со свободной индексацией и именами колонок:

col_1, col_2, col_3

In [2]:
c_1 = [1, 2, 3, 4, 5]
c_2 = [2, 3, 4, 5, 6]
c_3 = [3, 4, 5, 6, 7]

In [3]:
df = pd.DataFrame({'col_1': c_1, 'col_2': c_2, 'col_3': c_3})
df

   col_1  col_2  col_3
0      1      2      3
1      2      3      4
2      3      4      5
3      4      5      6
4      5      6      7

# Задача 2

Создайте датафрейм из данного словаря.

Сделайте так, чтобы лэйблы 'a', 'b', 'c' были именами колонок!

In [4]:
dict_ = {1: {'a':1, 'b':2, 'c':3}, 2: {'a':4, 'b':5, 'c':6}, 3: {'a':7, 'b':8, 'c':9}}

In [5]:
df2 = pd.DataFrame(dict_)
df2

   1  2  3
a  1  4  7
b  2  5  8
c  3  6  9

In [6]:
df2T = df2.T
df2T

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

В полученный датафрейм добавте колонку 'd' с рандомными числовыми значениями.

In [7]:
from random import randint

In [9]:
df2T['d'] = [randint(0, 10) for _ in range(df2T.shape[0])]
df2T

   a  b  c   d
1  1  2  3  10
2  4  5  6   1
3  7  8  9  10

# Задача 3

Выведте из датасета предыдущей задачи значения строки "2" и колонок 'b', 'c' с помощью функции loc[].

In [11]:
df2T.loc[2, ['b', 'c']]

b    5
c    6
Name: 2, dtype: int64

# Задача 4

Выделите из датафрейма только те строки, для которых в столбце 'a' находятся четные элементы.

In [13]:
df2T.loc[df2T['a']%2==0]

   a  b  c  d
2  4  5  6  1

# Задача 5
создайте новую колонку 'a_add_b' где будет сумма колокок 'a' и 'b'.

In [14]:
df2T['a_add_b'] = df2T['a'] + df2T['b']
df2T

   a  b  c   d  a_add_b
1  1  2  3  10        3
2  4  5  6   1        9
3  7  8  9  10       15

Проверьте четность новой колонки и ко всем нечетным прибавте 1. (фильтрация с пом loc[])

In [15]:
df2T.loc[df2T['a_add_b']%2==1, 'a_add_b'] += 1
df2T

   a  b  c   d  a_add_b
1  1  2  3  10        4
2  4  5  6   1       10
3  7  8  9  10       16

# Задача 6

Отсортируйте датафрейм по колонке 'a' в порядке убывания.

Затем обновите индексы (0,1,2...) с помощью функции reset_index

Удалите получившуюся колонку index

In [24]:
df2T.sort_values('a', ascending=False, inplace=True)
df2T.reset_index(inplace=True)
df2T.drop('index', axis=1, inplace=True)
df2T

   a  b  c   d  a_add_b
0  7  8  9  10       16
1  4  5  6   1       10
2  1  2  3  10        4